<?php

require 'user.php';

class main_class extends user {

//   function __construct() {
//     parent::__construct("conn_main_class");
//   }

  function __construct($file_connection) {
//    if (isset($file_connection)) {
//    $this->file_connection = $file_connection;
//    }
//    parent::__construct($this->file_connection);
    parent::__construct($this->file_connection = $file_connection);
  }

public function get_variable() {
    $variable = [
        "gender" => ["หญิง", "ชาย"],
        // "app_privilege" => [
        //     "" => "ยังไม่มีการเพิ่มสิทธิ์ในระบบ",
        //     "1" => "อำเภอ (ดูอย่างเดียว)",
        //     "2" => "อำเภอ (บันทึก)",
        //     "3" => "อำเภอ (admin อำเภอ)",
        //     "4" => "จังหวัด (บันทึก)",
        //     "5" => "จังหวัด (ออกรายงาน)",
        //     "6" => "จังหวัด (admin จังหวัด)",
        //     "7" => "ส่วนกลาง (ออกรายงาน)",
        //     "8" => "ส่วนกลาง (ผู้ดูแลระบบ)",
        //     "9" => "ผู้ดูแลระบบ ศสป.",
        // ],
        "app_privilege" => [
            "" => "ยังไม่มีการเพิ่มสิทธิ์ในระบบ",
            "1" => "",
            "2" => "แอดมินสถานีตำรวจ",
            "3" => "ผู้กำกับ",
            "4" => "สำนักงานอัยการ จังหวัด",
            "5" => "เจ้าหน้าที่รับเรื่อง กรมการปกครอง",
            "6" => "เจ้าหน้าที่รับเรื่อง สำนักงานอัยการสูงสุด",
            "7" => "สำนักงานอัยการสูงสุด",
            "8" => "สำนักการสอบสวนและนิติการ",
            "9" => "ผู้ดูแลระบบ ศสป.",
        ],
        "doc_level" => [
            "0" => "ยังไม่แสดง",
            "1" => "จังหวัดดูได้",
            "2" => "อำเภอดูได้",
            "3" => "ทั้งจังหวัดและอำเภอดูได้"
        ],
        "accept_status" => [
            "1" => "ส่งเรื่องแล้ว",
            "2" => "ขอข้อมูลเพิ่มเติม",
            "3" => "รับเรื่องแล้ว"
        ],
        "dopa_status" => [
            "0" => "",//ยังไม่ได้รับเรื่อง
            "1" => "รับเรื่องแล้ว",
            "2" => "ขอข้อมูลเพิ่มเติม",
            "3" => "ลงพื้นที่ตรวจสอบ",
            "4" => "ยืนยัน"
        ],
        "a_status" => [
            "0" => "",//ยังไม่ได้รับเรื่อง
            "1" => "รับเรื่องแล้ว",
            "2" => "ขอข้อมูลเพิ่มเติม",
            "3" => "ลงพื้นที่ตรวจสอบ",
            "4" => "ยืนยัน"
        ],
        "id_type" => [
            "1" => "เลขประจำตัวประชาชน",
            "2" => "หมายเลขหนังสือเดินทาง",
            "3" => "บัตรประจำตัวคนต่างด้าว",
            "4" => "อื่นๆ"
        ],
        "id_process" => [
            "1" => "อยู่ระหว่างการควบคุมตัว",
            "2" => "ผู้ถูกควบคุมตัวอยู่ในสถานที่ควบคุมตัวแล้ว ณ เวลาแจ้ง",
        ],
    ];
    return $variable;
}

}
